# GetIFCAggregateIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate..::..GetIFCAggregateIterator Method
IFCAggregate Class See Also
---
Returns a IFCAggregateIterator that iterates through the collection.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCAggregateIterator GetIFCAggregateIterator()
```

Visual Basic
---
```text
Public Function GetIFCAggregateIterator As IFCAggregateIterator
```

Visual C++
---
```text
public:
IFCAggregateIterator^ GetIFCAggregateIterator()
```

# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace